
Процедура СотрудникУжеРаботалРанееПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Не ЭтоПервичныйПрием;
КонецПроцедуры 

           Процедура УстановитьНаименованиеЗадачи (ТочкаМаршрутаБизнесПроцесса, Задача)
Задача.Наименование = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " " + СокрЛП(ФизЛицо.Наименование);
Конецпроцедуры  

Процедура ОбщаяПриСозданииЗадач (ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
Для каждого НоваяЗадача Из ФормируемыеЗадачи Цикл
УстановитьНаименованиеЗадачи (ТочкаМаршрутаБизнесПроцесса,НоваяЗадача);
КонецЦикла;
КонецПроцедуры 

Функция ПроверитьВыполнениеЗадачи (ТочкаМаршрутаБизнесПроцесса, Задача)
БП = Задача.БизнесПроцесс;
Результат = Ложь;
Если ТочкаМаршрутаБизнесПроцесса =
БизнесПроцессы.ПриемНовогоСотрудника.ТочкиМаршрута.ВводПервичныхДанныхФизЛица Тогда
Если ЗначениеЗаполнено  (БП.ФизЛицо) И
ЗначениеЗаполнено(БП.Сотрудник) Тогда
Результат = ЗначениеЗаполнено(БП.физЛицо.ДатаРождения) И ЗначениеЗаполнено(БП.ФизЛицо.Пол);
КонецЕсли;
ИначеЕсли ТочкаМаршрутаБизнесПроцесса =
Бизнеспроцессы.ПриемновогоСотрудника.ТочкиМаршрута.ВводПриемаНаРаботуВСтатусеПроект Тогда
Результат = ЗначениеЗаполнено(БП.ПриемнаРаботу);
ИначеЕсли ТочкамаршрутаБизнеспроцесса =
Бизнеспроцессы.ПриемновогоСотрудника.ТочкиМаршрута.УтверждениеПриемаНаРаботу Тогда
Докприем = БП.ПриемнаРаботу;
Результат = ЗначениеЗаполнено(Докприем.Оклад) И Докприем.Статус = Перечисления.Статусыдокументов.Утвержден;
КонецЕсли;
Возврат Результат;
Конецфункции           

Процедура ОбщаяПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
Если Не ПроверитьВыполнениеЗадачи(ТочкаМаршрутаБизнесПроцесса, Задача) Тогда
Сообщить ("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
Отказ = Истина;
КонецЕсли;
КонецПроцедуры