
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходСРемонтаСписокТехники.Номенклатура КАК Номенклатура,
		|	СУММА(ПриходСРемонтаСписокТехники.Количество) КАК Количество,
		|	ПриходСРемонтаСписокТехники.Характеристики КАК Характеристики
		|ПОМЕСТИТЬ ТабДок
		|ИЗ
		|	Документ.ПриходСРемонта.СписокТехники КАК ПриходСРемонтаСписокТехники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходСРемонта КАК ПриходСРемонта
		|		ПО ПриходСРемонтаСписокТехники.Ссылка = ПриходСРемонта.СписокТехники.Ссылка
		|ГДЕ
		|	ПриходСРемонта.СписокТехники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходСРемонтаСписокТехники.Номенклатура,
		|	ПриходСРемонтаСписокТехники.Характеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДок.Номенклатура КАК Номенклатура,
		|	ТабДок.Количество КАК Количество,
		|	ТабДок.Характеристики КАК Характеристики,
		|	ЕСТЬNULL(ТехникаВРемонтеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	ТабДок КАК ТабДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТехникаВРемонте.Остатки(
		|				&Момент,
		|				(Номенклатура, Характеристики) В
		|					(ВЫБРАТЬ
		|						ТабДок.Номенклатура КАК Номенклатура,
		|						ТабДок.Характеристики КАК Характеристики
		|					ИЗ
		|						ТабДок КАК ТабДок)) КАК ТехникаВРемонтеОстатки
		|		ПО ТабДок.Номенклатура = ТехникаВРемонтеОстатки.Номенклатура";
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос.УстановитьПараметр("Момент", неопределено);
	Иначе
		Запрос.УстановитьПараметр("Момент", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ТехникаВРаботе.Записывать = Истина;
	Движения.ТехникаВРемонте.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		// Приход в работу
		Движение = Движения.ТехникаВРаботе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.РабочееМесто = РабочееМесто;
		Движение.НомерЛицо = НомерЛицо;
		Движение.Количество = Выборка.Количество;
		
		Если Выборка.КоличествоОстаток < Выборка.Количество Тогда
			Отказ = Истина;
			Сообщить("Не хватает товара '" + Выборка.Номенклатура +  "' в количестве "+ (Выборка.Количество-Выборка.КоличествоОстаток));	
		КонецЕсли;
				
		// Расход с ремонта
		Движение = Движения.ТехникаВРемонте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;

КонецПроцедуры
