&НаКлиенте
Процедура ТоварыНаИнвентаризациюКоличествоФактическоеПриИзменении(Элемент)
	
	// Получаем строку, в которой пользователь изменил данные
	СтрокаТЧ = Элементы.ТоварыНаИнвентаризацию.ТекущиеДанные;
	
	 Если СтрокаТЧ <> Неопределено Тогда
		// Рассчитываем разницу по формуле: Фактическое - Учетное
		СтрокаТЧ.Разница = СтрокаТЧ.КоличествоФактическое - СтрокаТЧ.КоличествоУчетное;
	 КонецЕсли;
	
 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыКоличествоУчетноеПриИзменении(Элемент)
	 // Вставить содержимое обработчика.
 КонецПроцедуры
 
 
 &НаКлиенте
Процедура ТоварыНаИнвентаризациюКоличествоУчетноеПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТоварыНаИнвентаризацию.ТекущиеДанные;
	
	Если СтрокаТЧ <> Неопределено Тогда
		СтрокаТЧ.Разница = СтрокаТЧ.КоличествоФактическое - СтрокаТЧ.КоличествоУчетное;
	КонецЕсли;
	
КонецПроцедуры