&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    // Строка, которую сейчас редактирует пользователь
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    
    // Проверка, что строка получена
    Если СтрокаТЧ <> Неопределено Тогда
        // Рассчитываем сумму напрямую в этой строке
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
    КонецЕсли;
    
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВЗаказеНоменклатураПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.ТоварыВЗаказе.ТекущиеДанные;
    ТекущаяСтрока.Цена = ТекущаяСтрока.Номенклатура.ЦенаПродажи;
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры