    &НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)	
	  УстановитьТипРеквизита();	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипРеквизита()
    Если Строка(Объект.РабочееМесто) = "Материально ответственное лицо" Тогда
        Объект.НомерЛицо = Справочники.Сотрудники.ПустаяСсылка();
		Элементы.НомерЛицо.Заголовок = "Материально ответственное лицо"
    Иначе
        Объект.НомерЛицо = "";
		Элементы.НомерЛицо.Заголовок = "Номер места"
	КонецЕсли;
	Элементы.НомерЛицо.ВыбиратьТип = Ложь;
 КонецПроцедуры

