
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПередачаВРемонт.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаВРемонт.Дата КАК Дата,
	|	ПередачаВРемонт.Номер КАК Номер,
	|	ПередачаВРемонт.НомерЛицо КАК НомерЛицо,
	|	ПередачаВРемонт.РабочееМесто КАК РабочееМесто,
	|	ПередачаВРемонт.СписокТехники.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристики КАК Характеристики,
	|		Количество КАК Количество
	|	) КАК СписокТехники,
	|	ПередачаВРемонт.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	|	ПередачаВРемонт.ФирмаИсполнитель КАК ФирмаИсполнитель
	|ИЗ
	|	Документ.ПередачаВРемонт КАК ПередачаВРемонт
	|ГДЕ
	|	ПередачаВРемонт.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТехникиШапка = Макет.ПолучитьОбласть("СписокТехникиШапка");
	ОбластьСписокТехники = Макет.ПолучитьОбласть("СписокТехники");
	ТабДок.Очистить(); 
	
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьСписокТехникиШапка);
		ВыборкаСписокТехники = Выборка.СписокТехники.Выбрать();
		Пока ВыборкаСписокТехники.Следующий() Цикл  
			СуммаИтог = СуммаИтог+ВыборкаСписокТехники.Количество;
			ОбластьСписокТехники.Параметры.Заполнить(ВыборкаСписокТехники);
			ТабДок.Вывести(ОбластьСписокТехники, ВыборкаСписокТехники.Уровень());
		КонецЦикла;
        ОбластьИтог.Параметры.Всего = СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
