
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаВРемонтСписокТехники.Номенклатура КАК Номенклатура,
		|	СУММА(ПередачаВРемонтСписокТехники.Количество) КАК Количество,
		|	ПередачаВРемонтСписокТехники.Характеристики КАК Характеристики,
		|	ПередачаВРемонт.РабочееМесто КАК РабочееМесто,
		|	ПередачаВРемонт.НомерЛицо КАК НомерЛицо,
		|	ПередачаВРемонт.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
		|ПОМЕСТИТЬ ТабДок
		|ИЗ
		|	Документ.ПередачаВРемонт.СписокТехники КАК ПередачаВРемонтСписокТехники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаВРемонт КАК ПередачаВРемонт
		|		ПО ПередачаВРемонтСписокТехники.Ссылка = ПередачаВРемонт.СписокТехники.Ссылка
		|ГДЕ
		|	ПередачаВРемонт.СписокТехники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаВРемонтСписокТехники.Номенклатура,
		|	ПередачаВРемонтСписокТехники.Характеристики,
		|	ПередачаВРемонт.РабочееМесто,
		|	ПередачаВРемонт.НомерЛицо,
		|	ПередачаВРемонт.ДатаОкончанияРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДок.Номенклатура КАК Номенклатура,
		|	ТабДок.Количество КАК Количество,
		|	ТабДок.Характеристики КАК Характеристики,
		|	ТабДок.РабочееМесто КАК РабочееМесто,
		|	ТабДок.НомерЛицо КАК НомерЛицо,
		|	ЕСТЬNULL(ТехникаВРаботеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ТабДок.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
		|ИЗ
		|	ТабДок КАК ТабДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТехникаВРаботе.Остатки(
		|				&Момент,
		|				(Номенклатура, Характеристики, РабочееМесто, НомерЛицо) В
		|					(ВЫБРАТЬ
		|						ТабДок.Номенклатура КАК Номенклатура,
		|						ТабДок.Характеристики КАК Характеристики,
		|						ТабДок.РабочееМесто КАК РабочееМесто,
		|						ТабДок.НомерЛицо КАК НомерЛицо
		|					ИЗ
		|						ТабДок КАК ТабДок)) КАК ТехникаВРаботеОстатки
		|		ПО ТабДок.Номенклатура = ТехникаВРаботеОстатки.Номенклатура";
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос.УстановитьПараметр("Момент", неопределено);
	Иначе
		Запрос.УстановитьПараметр("Момент", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ТехникаВРаботе.Записывать = Истина;
	Движения.ТехникаВРемонте.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		// Расход с работы
		Движение = Движения.ТехникаВРаботе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.РабочееМесто = РабочееМесто;
		Движение.НомерЛицо = НомерЛицо;
		Движение.Количество = Выборка.Количество;
		
		Если Выборка.КоличествоОстаток < Выборка.Количество Тогда
			Отказ = Истина;
			Сообщить("Не хватает товара '" + Выборка.Номенклатура +  "' в количестве "+ (Выборка.Количество-Выборка.КоличествоОстаток));	
		КонецЕсли;
				
		// Приход в ремонт
		Движение = Движения.ТехникаВРемонте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.Количество = Выборка.Количество; 		
	КонецЦикла;

КонецПроцедуры
