
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВводТехникиВРаботу.ПолучитьМакет("Печать");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводТехникиВРаботу.Дата,
	|	ВводТехникиВРаботу.Номер,
	|	ВводТехникиВРаботу.НомерЛицо,
	|	ВводТехникиВРаботу.РабочееМесто,
	|	ВводТехникиВРаботу.СписокТехники.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Характеристики
	|	)
	|ИЗ
	|	Документ.ВводТехникиВРаботу КАК ВводТехникиВРаботу
	|ГДЕ
	|	ВводТехникиВРаботу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТехникиШапка = Макет.ПолучитьОбласть("СписокТехникиШапка");
	ОбластьСписокТехники = Макет.ПолучитьОбласть("СписокТехники");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокТехникиШапка);
		ВыборкаСписокТехники = Выборка.СписокТехники.Выбрать();
		
		СуммаИтог = 0;
		Пока ВыборкаСписокТехники.Следующий() Цикл
			СуммаИтог = СуммаИтог+ВыборкаСписокТехники.Количество;
			ОбластьСписокТехники.Параметры.Заполнить(ВыборкаСписокТехники);
			ТабДок.Вывести(ОбластьСписокТехники, ВыборкаСписокТехники.Уровень());
		КонецЦикла;
        ОбластьИтог.Параметры.ВсегоПоДокументу = СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;   

	
	
	
	
	//}}
КонецПроцедуры
