
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводТехникиВРаботуСписокТехники.Номенклатура КАК Номенклатура,
		|	СУММА(ВводТехникиВРаботуСписокТехники.Количество) КАК Количество,
		|	ВводТехникиВРаботуСписокТехники.Характеристики КАК Характеристики
		|ПОМЕСТИТЬ ТабДок
		|ИЗ
		|	Документ.ВводТехникиВРаботу.СписокТехники КАК ВводТехникиВРаботуСписокТехники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводТехникиВРаботу КАК ВводТехникиВРаботу
		|		ПО ВводТехникиВРаботуСписокТехники.Ссылка = ВводТехникиВРаботу.Ссылка
		|ГДЕ
		|	ВводТехникиВРаботу.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводТехникиВРаботуСписокТехники.Номенклатура,
		|	ВводТехникиВРаботуСписокТехники.Характеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДок.Номенклатура КАК Номенклатура,
		|	ТабДок.Количество КАК Количество,
		|	ТабДок.Характеристики КАК Характеристики,
		|	ТоварыНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ТабДок КАК ТабДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладе.Остатки(
		|				&Момент,
		|				(Номенклатура, Характеристики) В
		|					(ВЫБРАТЬ
		|						ТабДок.Номенклатура КАК Номенклатура,
		|						ТабДок.Характеристики КАК Характеристики
		|					ИЗ
		|						ТабДок КАК ТабДок)) КАК ТоварыНаСкладеОстатки
		|		ПО ТабДок.Номенклатура = ТоварыНаСкладеОстатки.Номенклатура";
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос.УстановитьПараметр("Момент", неопределено);
	Иначе
		Запрос.УстановитьПараметр("Момент", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Движения.ТехникаВРаботе.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		// Расход со склада
		Движение = Движения.ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.Количество = Выборка.Количество;
		
		Если Выборка.КоличествоОстаток < Выборка.Количество Тогда
			Отказ = Истина;
			Сообщить("Не хватает товара '" + Выборка.Номенклатура +  "' в количестве "+ (Выборка.Количество-Выборка.КоличествоОстаток));	
		КонецЕсли;
		
		// Приход в работу
		Движение = Движения.ТехникаВРаботе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Характеристики = Выборка.Характеристики;
		Движение.РабочееМесто = РабочееМесто;
		Движение.НомерЛицо = НомерЛицо;
		Движение.Количество = Выборка.Количество;	
			
	КонецЦикла;
	   	
КонецПроцедуры
