&НаСервере
Процедура СформироватьДанные()
Результат.Очистить();
Прогноз.Очистить();
Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ
|	ТехникаВРемонте.Период КАК Период,
|	ТехникаВРемонте.Регистратор КАК Регистратор,
|	ТехникаВРемонте.Характеристики КАК Характеристики,
|	ТехникаВРемонте.Количество КАК Количество,
|	ТехникаВРемонте.Номенклатура КАК Номенклатура
|ИЗ
|	РегистрНакопления.ТехникаВРемонте КАК ТехникаВРемонте";

 РезультатЗапроса = Запрос.Выполнить();
Аналитика = Новый ПостроительОтчетаАнализаДанных;
Аналитика.ИсточникДанных = РезультатЗапроса;
Аналитика.ТипАнализа = Тип(ТипАнализа);
Если Тип(ТипАнализа) = Тип("АнализДанныхОбщаяСтатистика") Тогда
 Аналитика.НастройкаКолонок.Регистратор.ТипКолонки =
ТипКолонкиАнализаДанныхОбщаяСтатистика.НеИспользуемая;
ИначеЕсли Тип(ТипАнализа) = Тип("АнализДанныхДеревоРешений") Тогда
 Аналитика.НастройкаКолонок.Регистратор.ТипКолонки =
ТипКолонкиАнализаДанныхДеревоРешений.НеИспользуемая;
 Аналитика.НастройкаКолонок.Характеристики.ТипКолонки =
ТипКолонкиАнализаДанныхДеревоРешений.Прогнозируемая;
 Аналитика.НастройкаКолонок.Номенклатура.ТипКолонки =
ТипКолонкиАнализаДанныхДеревоРешений.НеИспользуемая;
 Аналитика.Параметры.МаксимальнаяГлубина.Значение = 100;
 Аналитика.Параметры.ТипУпрощения.Значение =
ТипУпрощенияДереваРешений.НеУпрощать;
ИначеЕсли Тип(ТипАнализа) = Тип("АнализДанныхКластеризация") Тогда
 Аналитика.НастройкаКолонок.Период.ТипКолонки =
ТипКолонкиАнализаДанныхКластеризация.НеИспользуемая;
 Аналитика.НастройкаКолонок.Регистратор.ТипКолонки =
ТипКолонкиАнализаДанныхКластеризация.НеИспользуемая;
 Аналитика.НастройкаКолонок.Партнер.ТипКолонки =
ТипКолонкиАнализаДанныхКластеризация.Ключ;
 Аналитика.НастройкаКолонок.Номенклатура.ТипКолонки =
ТипКолонкиАнализаДанныхКластеризация.ВходнаяИПрогнозируемая;
ИначеЕсли Тип(ТипАнализа) = Тип("АнализДанныхПоискПоследовательностей") Тогда
 Аналитика.НастройкаКолонок.Регистратор.ТипКолонки =
ТипКолонкиАнализаДанныхПоискПоследовательностей.НеИспользуемая;
 Аналитика.НастройкаКолонок.Номенклатура.ТипКолонки =
ТипКолонкиАнализаДанныхПоискПоследовательностей.Элемент;
 Аналитика.НастройкаКолонок.Партнер.ТипКолонки =
ТипКолонкиАнализаДанныхПоискПоследовательностей.Последовательность;
ИначеЕсли Тип(ТипАнализа) = Тип("АнализДанныхПоискАссоциаций") Тогда
 Аналитика.НастройкаКолонок.Партнер.ТипКолонки =
ТипКолонкиАнализаДанныхПоискАссоциаций.НеИспользуемая;
 Аналитика.НастройкаКолонок.Период.ТипКолонки =
ТипКолонкиАнализаДанныхПоискАссоциаций.НеИспользуемая;
 Аналитика.НастройкаКолонок.Количество.ТипКолонки =
ТипКолонкиАнализаДанныхПоискАссоциаций.НеИспользуемая;
 Аналитика.НастройкаКолонок.Сумма.ТипКолонки =
ТипКолонкиАнализаДанныхПоискАссоциаций.НеИспользуемая;
КонецЕсли;
Аналитика.Выполнить();
Аналитика.Вывести(Результат);
Если Тип(ТипАнализа) = Тип("АнализДанныхОбщаяСтатистика") Тогда
 Возврат;
КонецЕсли;
МодельПрогноза = Аналитика.Результат.СоздатьМодельПрогноза();
МодельПрогноза.ИсточникДанных = РезультатЗапроса;
ТЗ = МодельПрогноза.Выполнить();
Построитель = Новый ПостроительОтчета;
Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);
Построитель.Выполнить();
Построитель.Вывести(Прогноз);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
Если ПустаяСтрока(ТипАнализа) Тогда
 Возврат;
КонецЕсли;
СформироватьДанные();
КонецПроцедуры