
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПередачаТехники.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаТехники.Дата,
	|	ПередачаТехники.НовоеНомерЛицо,
	|	ПередачаТехники.НовоеРабочееМесто,
	|	ПередачаТехники.Номер,
	|	ПередачаТехники.НомерЛицо,
	|	ПередачаТехники.РабочееМесто,
	|	ПередачаТехники.СписокТехники.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Характеристики
	|	)
	|ИЗ
	|	Документ.ПередачаТехники КАК ПередачаТехники
	|ГДЕ
	|	ПередачаТехники.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТехникиШапка = Макет.ПолучитьОбласть("СписокТехникиШапка");
	ОбластьСписокТехники = Макет.ПолучитьОбласть("СписокТехники");
	ТабДок.Очистить();
	
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");

	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
        СуммаИтог = 0;
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокТехникиШапка);
		ВыборкаСписокТехники = Выборка.СписокТехники.Выбрать();
		Пока ВыборкаСписокТехники.Следующий() Цикл
			СуммаИтог = СуммаИтог+ВыборкаСписокТехники.Количество;
			ОбластьСписокТехники.Параметры.Заполнить(ВыборкаСписокТехники);
			ТабДок.Вывести(ОбластьСписокТехники, ВыборкаСписокТехники.Уровень());
		КонецЦикла;
        ОбластьИтог.Параметры.Всего = СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
