
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр КадроваяИстория - записываем с любым статусом
	Движения.КадроваяИстория.Записывать = Истина;
	Движение = Движения.КадроваяИстория.Добавить();
	Движение.Период = ДатаПриема;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;

	// регистр ПлановыеНачисления - только в статусе Утвержден
	Если Статус = Перечисления.СтатусыДокументов.Утвержден Тогда
		Движения.ПлановыеНачисления.Записывать = Истина;
		Движение = Движения.ПлановыеНачисления.Добавить();
		Движение.Период = ДатаПриема;
		Движение.Сотрудник = Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
		Движение.Размер = Оклад;
	КонецЕсли;

КонецПроцедуры
